xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_lcd.h
/**
  ******************************************************************************
  * @file    py32l090_ll_lcd.h
  * @author  MCU Application Team
  * @brief   Header file of LCD LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32L090_LL_LCD_H
#define __PY32L090_LL_LCD_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32l0xx.h"
/** @addtogroup PY32L090_LL_Driver
  * @{
  */

#if defined (LCD)

/** @defgroup LCD_LL LCD
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup LCD_LL_ES_INIT LCD Exported Init structures
  * @{
  */

typedef struct
{
  uint32_t Contrast;        /*!< Configures the LCD Contrast.
                                 This parameter can be one value of @ref LCD_LL_EC_Contrast */
  uint32_t BiasSrc;         /*!< Configures the LCD Bias Source.
                                 This parameter can be one value of @ref LCD_LL_EC_BiasSource */
  uint32_t Duty;            /*!< Configures the LCD Duty.
                                 This parameter can be one value of @ref LCD_LL_EC_Duty */
  uint32_t Bias;            /*!< Configures the LCD Bias.
                                 This parameter can be one value of @ref LCD_LL_EC_Bias */
  uint32_t ScanFreq;         /*!< Configures the LCD Scan Frequency.
                                 This parameter can be one value of @ref LCD_LL_EC_ScanFrequency */

  uint32_t ComSegDriveType;  /*!< Configures the LCD COM/SEG Drive Type.
                                 This parameter can be one value of @ref LCD_LL_EC_ComSegDriveType */

  uint32_t Mode;            /*!< Configures the LCD Mode.
                                 This parameter can be one value of @ref LCD_LL_EC_Mode */
}LL_LCD_InitTypeDef;


typedef struct
{
    uint32_t Seg0_31;
    union{
        uint32_t Seg32_39_Com0_7;
        struct
        {
            uint32_t Seg32_35     :4;
            uint32_t Seg36Com4    :1;
            uint32_t Seg37Com5    :1;
            uint32_t Seg38Com6    :1;
            uint32_t Seg39Com7    :1;
            uint32_t Com0_3       :4;
        }SegComBit;
    }Seg32_39_Com0_7_t;
}LL_LCD_SegComTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup LCD_LL_Exported_Constants LCD Exported Constants
  * @{
  */



/** @defgroup LCD_LL_EC_BiasSource LCD Bias Source
  * @{
  */
#define LL_LCD_BIAS_SOURCE_INTERNAL_RESISTANCE     ((uint32_t)0x00000000U)          /* Internal resistance mode */
#define LL_LCD_BIAS_SOURCE_EXTERNAL_RESISTANCE     (LCD_CR_BSEL_0)                  /* External resistance mode */
#define LL_LCD_BIAS_SOURCE_EXTERNAL_CAPACITANCE    (LCD_CR_BSEL_1)                  /* External capacitance mode */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_DEADTIME LCD Dead Time
  * @{
  */
#define LL_LCD_DEAD_TIME_0                 ((uint32_t)0x00000000U)                          /*!< NO DeadTime */
#define LL_LCD_DEAD_TIME_1                 (LCD_CR_DEAD_0)                                  /*!< DeadTime 1   */
#define LL_LCD_DEAD_TIME_2                 (LCD_CR_DEAD_1)                                  /*!< DeadTime 2   */
#define LL_LCD_DEAD_TIME_3                 (LCD_CR_DEAD_1 | LCD_CR_DEAD_0)                  /*!< DeadTime 3  */
#define LL_LCD_DEAD_TIME_4                 (LCD_CR_DEAD_2)                                  /*!< DeadTime 4   */
#define LL_LCD_DEAD_TIME_5                 (LCD_CR_DEAD_2 | LCD_CR_DEAD_0)                  /*!< DeadTime 5    */
#define LL_LCD_DEAD_TIME_6                 (LCD_CR_DEAD_2 | LCD_CR_DEAD_1)                  /*!< DeadTime 6    */
#define LL_LCD_DEAD_TIME_7                 (LCD_CR_DEAD_2 | LCD_CR_DEAD_1 | LCD_CR_DEAD_0)  /*!< DeadTime 7    */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_FastCharge_Cycle LCD FastCharge Cycle
  * @{
  */
#define LL_LCD_FASTCHARGE_CYCLE_1_2        ((uint32_t)0x00000000U)             /* Fast Charge 1/2 Cycle */
#define LL_LCD_FASTCHARGE_CYCLE_1_4        (LCD_CR_FCCTL_0)                    /* Fast Charge 1/4 Cycle */
#define LL_LCD_FASTCHARGE_CYCLE_1_8        (LCD_CR_FCCTL_1)                    /* Fast Charge 1/8 Cycle */
#define LL_LCD_FASTCHARGE_CYCLE_1_16       (LCD_CR_FCCTL_0 | LCD_CR_FCCTL_1)   /* Fast Charge 1/16 Cycle */
#define LL_LCD_FASTCHARGE_CYCLE_1_32       (LCD_CR_FCCTL_2)                    /* Fast Charge 1/32 Cycle */
#define LL_LCD_FASTCHARGE_CYCLE_1_64       (LCD_CR_FCCTL_2 | LCD_CR_FCCTL_0)   /* Fast Charge 1/64 Cycle */
#define LL_LCD_FASTCHARGE_CYCLE_1_128      (LCD_CR_FCCTL_2 | LCD_CR_FCCTL_1)   /* Fast Charge 1/128 Cycle */
/**
  * @}
  */

