xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_lcd.h
/** @defgroup LCD_LL_EC_VOLTAGE_SOURCE LCD Voltage Source
  * @{
  */
/* #define LL_LCD_VOLTAGE_SOURCE_VCCA                    ((uint32_t)0x00000000U)                  */         /* From VCCA */
/* #define LL_LCD_VOLTAGE_SOURCE_INTERNALVOLTAGE         (LCD_CR_VSEL)                            */         /* From Internal Voltage */
/**
  * @}
  */


/** @defgroup LCD_LL_EC_VOLTAGE_LEVEL LCD Voltage Level
  * @{
  */
/* #define LL_LCD_VOLTAGE_LEVEL_2P6          ((uint32_t)0x00000000U)                             */             /* 2.6V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_2P74         (LCD_CR_VCP_SEL_0)                                  */             /* 2.74V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_2P88         (LCD_CR_VCP_SEL_1)                                  */             /* 2.88V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_3P02         (LCD_CR_VCP_SEL_0 | LCD_CR_VCP_SEL_1)               */             /* 3.02V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_3P16         (LCD_CR_VCP_SEL_2)                                  */             /* 3.16V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_3P3          (LCD_CR_VCP_SEL_2 | LCD_CR_VCP_SEL_0)               */             /* 3.3V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_3P44         (LCD_CR_VCP_SEL_2 | LCD_CR_VCP_SEL_1)               */             /* 3.44V VCP SEL */
/* #define LL_LCD_VOLTAGE_LEVEL_3P58         (LCD_CR_VCP_SEL_2 | LCD_CR_VCP_SEL_1 | LCD_CR_VCP_SEL_0)   */      /* 3.58V VCP SEL */

/**
  * @}
  */

/** @defgroup LCD_LL_EC_ChargePump_Settime LCD ChargePump Settime
  * @{
  */
/* #define LL_LCD_CHARGEPUMP_SETTIME_256CLOCK        ((uint32_t)0x00000000U)             */     /* ChargePump Settime 256 LSE/LSI Clocks */
/* #define LL_LCD_CHARGEPUMP_SETTIME_512CLOCK        (LCD_CR_CP_ST_0)                    */     /* ChargePump Settime 512 LSE/LSI Clocks */
/* #define LL_LCD_CHARGEPUMP_SETTIME_1024CLOCK       (LCD_CR_CP_ST_1)                    */     /* ChargePump Settime 1024 LSE/LSI Clocks */
/* #define LL_LCD_CHARGEPUMP_SETTIME_2048CLOCK       (LCD_CR_CP_ST_0 | LCD_CR_CP_ST_1)   */     /* ChargePump Settime 2048 LSE/LSI Clocks */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_ChargePump_Freq LCD ChargePump Freq
  * @{
  */
/* #define LL_LCD_CHARGEPUMP_FREQ_512HZ        ((uint32_t)0x00000000U)                  */     /* ChargePump Freq 512 Hz */
/* #define LL_LCD_CHARGEPUMP_FREQ_1024HZ       (LCD_CR_CP_FRQ_0)                        */     /* ChargePump Freq 1024 Hz */
/* #define LL_LCD_CHARGEPUMP_FREQ_2048HZ       (LCD_CR_CP_FRQ_1)                        */     /* ChargePump Freq 2048 Hz */
/* #define LL_LCD_CHARGEPUMP_FREQ_4096HZ       (LCD_CR_CP_FRQ_0 | LCD_CR_CP_FRQ_1)      */     /* ChargePump Freq 4096 Hz */
/* #define LL_LCD_CHARGEPUMP_FREQ_8192HZ       (LCD_CR_CP_FRQ_2)                        */     /* ChargePump Freq 8192 Hz */
/* #define LL_LCD_CHARGEPUMP_FREQ_16384HZ      (LCD_CR_CP_FRQ_2 | LCD_CR_CP_FRQ_0)      */     /* ChargePump Freq 16384 Hz */
/**
  * @}
  */


/** @defgroup LCD_LL_EC_ComSegDriveType LCD ComSegDrive Type
  * @{
  */
#define LL_LCD_COMSEGDRIVE_TYPE_A                 ((uint32_t)0x00000000U)             /*!< Com/Seg Drive Type A */
#define LL_LCD_COMSEGDRIVE_TYPE_B                 (LCD_CR_COMSEG_DRV_TYPE)            /*!< Com/Seg Drive Type B */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_Contrast LCD Contrast
  * @{
  */
#define LL_LCD_CONTRASTLEVEL_0               ((uint32_t)0x00000000U)
#define LL_LCD_CONTRASTLEVEL_1               (LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_2               (LCD_CR_CONTRAST_1)
#define LL_LCD_CONTRASTLEVEL_3               (LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_4               (LCD_CR_CONTRAST_2)
#define LL_LCD_CONTRASTLEVEL_5               (LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_6               (LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1)
#define LL_LCD_CONTRASTLEVEL_7               (LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_8               (LCD_CR_CONTRAST_3)
#define LL_LCD_CONTRASTLEVEL_9               (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_10              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_1)
#define LL_LCD_CONTRASTLEVEL_11              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_12              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2)
#define LL_LCD_CONTRASTLEVEL_13              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_0)
#define LL_LCD_CONTRASTLEVEL_14              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1)
#define LL_LCD_CONTRASTLEVEL_15              (LCD_CR_CONTRAST_3 | LCD_CR_CONTRAST_2 | LCD_CR_CONTRAST_1 | LCD_CR_CONTRAST_0)
/**
  * @}
  */

/** @defgroup LCD_LL_EC_Duty LCD Duty
  * @{
  */
#define LL_LCD_DUTY_STATIC                 ((uint32_t)0x00000000U)                              /*!< Static duty */
#define LL_LCD_DUTY_1_2                    (LCD_CR_DUTY_0)                                      /*!< 1/2 duty    */
#define LL_LCD_DUTY_1_3                    (LCD_CR_DUTY_1)                                      /*!< 1/3 duty    */
#define LL_LCD_DUTY_1_4                    ((LCD_CR_DUTY_1 | LCD_CR_DUTY_0))                    /*!< 1/4 duty    */
#define LL_LCD_DUTY_1_6                    ((LCD_CR_DUTY_2 | LCD_CR_DUTY_0))                    /*!< 1/6 duty    */
#define LL_LCD_DUTY_1_8                    ((LCD_CR_DUTY_2 | LCD_CR_DUTY_1 | LCD_CR_DUTY_0))    /*!< 1/8 duty    */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_Bias LCD Bias
  * @{
  */
#define LL_LCD_BIAS_1_4                    ((uint32_t)0x00000000U)   /*!< 1/4 Bias */
#define LL_LCD_BIAS_1_2                    (LCD_CR_BIAS_0)           /*!< 1/2 Bias */
#define LL_LCD_BIAS_1_3                    (LCD_CR_BIAS_1)           /*!< 1/3 Bias */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_ScanFrequency LCD Scan Frequency
  * @{
  */
#define LL_LCD_SCAN_FREQ_64HZ               ((uint32_t)0x00000000U)                  /*!< Scan Frequency 64Hz */
#define LL_LCD_SCAN_FREQ_128HZ              (LCD_CR_LCDCLK_0)                        /*!< Scan Frequency 128Hz */
#define LL_LCD_SCAN_FREQ_256HZ              (LCD_CR_LCDCLK_1)                        /*!< Scan Frequency 256Hz */
#define LL_LCD_SCAN_FREQ_512HZ              (LCD_CR_LCDCLK_1 | LCD_CR_LCDCLK_0)      /*!< Scan Frequency 512Hz */
/**
  * @}
  */

