xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_lcd.h
/** @defgroup LCD_LL_EC_Mode LCD Mode
  * @{
  */
#define LL_LCD_MODE_0                    ((uint32_t)0x00000000U)                     /*!< LCD Mode 0 */
#define LL_LCD_MODE_1                    (LCD_CSR_MODE)                              /*!< LCD Mode 1 */
/**
  * @}
  */

/** @defgroup LCD_LL_EC_SWCapDrive_Number LCD SWCapDrive Number
  * @{
  */
#define LL_LCD_SWCAPDRIVE_NUMBER_4          (0x00000000U)
#define LL_LCD_SWCAPDRIVE_NUMBER_8          (LCD_CSR_SWCAP_DRV_NUM_0)
#define LL_LCD_SWCAPDRIVE_NUMBER_16         (LCD_CSR_SWCAP_DRV_NUM_1)
#define LL_LCD_SWCAPDRIVE_NUMBER_32         (LCD_CSR_SWCAP_DRV_NUM_1 | LCD_CSR_SWCAP_DRV_NUM_0)
#define LL_LCD_SWCAPDRIVE_NUMBER_64         (LCD_CSR_SWCAP_DRV_NUM_2)
/**
  * @}
  */

/** @defgroup LCD_LL_EC_RAMRegister LCD RAMRegister
  * @{
  */
#define LL_LCD_RAM_REGISTER0               ((uint32_t)0x00000000U) /*!< LCD RAM Register 0  */
#define LL_LCD_RAM_REGISTER1               ((uint32_t)0x00000001U) /*!< LCD RAM Register 1  */
#define LL_LCD_RAM_REGISTER2               ((uint32_t)0x00000002U) /*!< LCD RAM Register 2  */
#define LL_LCD_RAM_REGISTER3               ((uint32_t)0x00000003U) /*!< LCD RAM Register 3  */
#define LL_LCD_RAM_REGISTER4               ((uint32_t)0x00000004U) /*!< LCD RAM Register 4  */
#define LL_LCD_RAM_REGISTER5               ((uint32_t)0x00000005U) /*!< LCD RAM Register 5  */
#define LL_LCD_RAM_REGISTER6               ((uint32_t)0x00000006U) /*!< LCD RAM Register 6  */
#define LL_LCD_RAM_REGISTER7               ((uint32_t)0x00000007U) /*!< LCD RAM Register 7  */
#define LL_LCD_RAM_REGISTER8               ((uint32_t)0x00000008U) /*!< LCD RAM Register 8  */
#define LL_LCD_RAM_REGISTER9               ((uint32_t)0x00000009U) /*!< LCD RAM Register 9  */
#define LL_LCD_RAM_REGISTER10              ((uint32_t)0x0000000AU) /*!< LCD RAM Register 10  */
#define LL_LCD_RAM_REGISTER11              ((uint32_t)0x0000000BU) /*!< LCD RAM Register 11  */
#define LL_LCD_RAM_REGISTER12              ((uint32_t)0x0000000CU) /*!< LCD RAM Register 12  */
#define LL_LCD_RAM_REGISTER13              ((uint32_t)0x0000000DU) /*!< LCD RAM Register 13  */
#define LL_LCD_RAM_REGISTER14              ((uint32_t)0x0000000EU) /*!< LCD RAM Register 14  */
#define LL_LCD_RAM_REGISTER15              ((uint32_t)0x0000000FU) /*!< LCD RAM Register 15  */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup LCD_LL_Exported_Macros LCD Exported Macros
  * @{
  */

/** @defgroup LCD_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in LCD register
  * @param  __INSTANCE__ LCD Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_LCD_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in LCD register
  * @param  __INSTANCE__ LCD Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_LCD_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */
  
/* Exported functions --------------------------------------------------------*/
/** @defgroup LCD_LL_Exported_Functions LCD Exported Functions
  * @{
  */

/** @defgroup LCD_LL_EF_CONTRASTLEVEL LCD Constrast Level
  * @{
  */
/**
  * @brief  Set LCD Contrast.
  * @param  LCDx LCD Instance
  * @param  Contrast This parameter can be one of the following values:
  *         @arg @ref LL_LCD_CONTRASTLEVEL_0
  *         @arg @ref LL_LCD_CONTRASTLEVEL_1
  *         @arg @ref LL_LCD_CONTRASTLEVEL_2
  *         @arg @ref LL_LCD_CONTRASTLEVEL_3
  *         @arg @ref LL_LCD_CONTRASTLEVEL_4
  *         @arg @ref LL_LCD_CONTRASTLEVEL_5
  *         @arg @ref LL_LCD_CONTRASTLEVEL_6
  *         @arg @ref LL_LCD_CONTRASTLEVEL_7
  *         @arg @ref LL_LCD_CONTRASTLEVEL_8
  *         @arg @ref LL_LCD_CONTRASTLEVEL_9
  *         @arg @ref LL_LCD_CONTRASTLEVEL_10
  *         @arg @ref LL_LCD_CONTRASTLEVEL_11
  *         @arg @ref LL_LCD_CONTRASTLEVEL_12
  *         @arg @ref LL_LCD_CONTRASTLEVEL_13
  *         @arg @ref LL_LCD_CONTRASTLEVEL_14
  *         @arg @ref LL_LCD_CONTRASTLEVEL_15
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetContrast(LCD_TypeDef *LCDx, uint32_t Contrast)
{
  MODIFY_REG(LCDx->CR, LCD_CR_CONTRAST, Contrast);
}

/**
  * @brief  Get LCD contrast.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_CONTRASTLEVEL_0
  *         @arg @ref LL_LCD_CONTRASTLEVEL_1
  *         @arg @ref LL_LCD_CONTRASTLEVEL_2
  *         @arg @ref LL_LCD_CONTRASTLEVEL_3
  *         @arg @ref LL_LCD_CONTRASTLEVEL_4
  *         @arg @ref LL_LCD_CONTRASTLEVEL_5
  *         @arg @ref LL_LCD_CONTRASTLEVEL_6
  *         @arg @ref LL_LCD_CONTRASTLEVEL_7
  *         @arg @ref LL_LCD_CONTRASTLEVEL_8
  *         @arg @ref LL_LCD_CONTRASTLEVEL_9
  *         @arg @ref LL_LCD_CONTRASTLEVEL_10
  *         @arg @ref LL_LCD_CONTRASTLEVEL_11
  *         @arg @ref LL_LCD_CONTRASTLEVEL_12
  *         @arg @ref LL_LCD_CONTRASTLEVEL_13
  *         @arg @ref LL_LCD_CONTRASTLEVEL_14
  *         @arg @ref LL_LCD_CONTRASTLEVEL_15
  */
__STATIC_INLINE uint32_t LL_LCD_GetContrast(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_CONTRAST));
}

/**
  * @}
  */

/** @defgroup LCD_LL_EF_DEADTIME LCD Dead Time
  * @{
  */
/**
  * @brief  Set LCD Dead Time.
  * @param  LCDx LCD Instance
  * @param  Time This parameter can be one of the following values:
  *         @arg @ref LL_LCD_DEAD_TIME_0
  *         @arg @ref LL_LCD_DEAD_TIME_1
  *         @arg @ref LL_LCD_DEAD_TIME_2
  *         @arg @ref LL_LCD_DEAD_TIME_3
  *         @arg @ref LL_LCD_DEAD_TIME_4
  *         @arg @ref LL_LCD_DEAD_TIME_5
  *         @arg @ref LL_LCD_DEAD_TIME_6
  *         @arg @ref LL_LCD_DEAD_TIME_7
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetDeadTime(LCD_TypeDef *LCDx, uint32_t Time)
{
  MODIFY_REG(LCDx->CR, LCD_CR_DEAD, Time);
}

/**
  * @brief  Get LCD Dead Time.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_DEAD_TIME_0
  *         @arg @ref LL_LCD_DEAD_TIME_1
  *         @arg @ref LL_LCD_DEAD_TIME_2
  *         @arg @ref LL_LCD_DEAD_TIME_3
  *         @arg @ref LL_LCD_DEAD_TIME_4
  *         @arg @ref LL_LCD_DEAD_TIME_5
  *         @arg @ref LL_LCD_DEAD_TIME_6
  *         @arg @ref LL_LCD_DEAD_TIME_7
  */
__STATIC_INLINE uint32_t LL_LCD_GetDeadTime(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_DEAD));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_BIASSOURCE LCD BIAS Source
  * @{
  */
/**
  * @brief  Set LCD bias source.
  * @param  LCDx LCD Instance
  * @param  BiasSource This parameter can be one of the following values:
  *         @arg @ref LL_LCD_BIAS_SOURCE_INTERNAL_RESISTANCE
  *         @arg @ref LL_LCD_BIAS_SOURCE_EXTERNAL_RESISTANCE
  *         @arg @ref LL_LCD_BIAS_SOURCE_EXTERNAL_CAPACITANCE
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetBiasSource(LCD_TypeDef *LCDx, uint32_t BiasSource)
{
  MODIFY_REG(LCDx->CR, LCD_CR_BSEL, BiasSource);
}

/**
  * @brief  Get LCD bias source.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_BIAS_SOURCE_INTERNAL_RESISTANCE
  *         @arg @ref LL_LCD_BIAS_SOURCE_EXTERNAL_RESISTANCE
  *         @arg @ref LL_LCD_BIAS_SOURCE_EXTERNAL_CAPACITANCE
  */
__STATIC_INLINE uint32_t LL_LCD_GetBiasSource(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_BSEL));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_DUTY LCD Duty
  * @{
  */
/**
  * @brief  Set LCD duty.
  * @param  LCDx LCD Instance
  * @param  Duty This parameter can be one of the following values:
  *         @arg @ref LL_LCD_DUTY_STATIC
  *         @arg @ref LL_LCD_DUTY_1_2
  *         @arg @ref LL_LCD_DUTY_1_3
  *         @arg @ref LL_LCD_DUTY_1_4
  *         @arg @ref LL_LCD_DUTY_1_6
  *         @arg @ref LL_LCD_DUTY_1_8
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetDuty(LCD_TypeDef *LCDx, uint32_t Duty)
{
  MODIFY_REG(LCDx->CR, LCD_CR_DUTY, Duty);
}

/**
  * @brief  Get LCD duty.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_DUTY_STATIC
  *         @arg @ref LL_LCD_DUTY_1_2
  *         @arg @ref LL_LCD_DUTY_1_3
  *         @arg @ref LL_LCD_DUTY_1_4
  *         @arg @ref LL_LCD_DUTY_1_6
  *         @arg @ref LL_LCD_DUTY_1_8
  */
__STATIC_INLINE uint32_t LL_LCD_GetDuty(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_DUTY));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_FASTCHARGE_CYCLE FastCharge Cycle
  * @{
  */
/**
  * @brief  Set LCD Fast Charge Cycle.
  * @param  LCDx LCD Instance
  * @param  FastCharge This parameter can be one of the following values:
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_2
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_4
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_8
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_16
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_32
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_64
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_128
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetFastChargeCycle(LCD_TypeDef *LCDx, uint32_t FastCharge)
{
  MODIFY_REG(LCDx->CR, LCD_CR_FCCTL, FastCharge);
}

/**
  * @brief  Get LCD FastChange Cycle.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_2
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_4
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_8
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_16
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_32
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_64
  *         @arg @ref LL_LCD_FASTCHARGE_CYCLE_1_128
  */
__STATIC_INLINE uint32_t LL_LCD_GetFastChargeCycle(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_FCCTL));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_VOLTAGE LCD Voltage
  * @{
  */
/**
  * @brief  Set LCD Voltage Source
  * @param  LCDx LCD Instance
  * @param  Time This parameter can be one of the following values:
  *         @arg @ref LL_LCD_VOLTAGE_SOURCE_VCCA
  *         @arg @ref LL_LCD_VOLTAGE_SOURCE_INTERNALVOLTAGE
  * @retval None
  */
/*
__STATIC_INLINE void LL_LCD_SetVoltageSource(LCD_TypeDef *LCDx, uint32_t Source)
{
  MODIFY_REG(LCDx->CR, LCD_CR_VSEL, Source);
}
*/

/**
  * @brief  Get LCD Voltage Source
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_VOLTAGE_SOURCE_VCCA
  *         @arg @ref LL_LCD_VOLTAGE_SOURCE_INTERNALVOLTAGE
  */
/*
__STATIC_INLINE uint32_t LL_LCD_GetVoltageSource(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_VSEL));
}
*/

/**
  * @brief  Set LCD Voltage Level
  * @param  LCDx LCD Instance
  * @param  Time This parameter can be one of the following values:
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_2P6
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_2P74
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_2P88
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P02
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P16
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P3
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P44
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P58
  * @retval None
  */
/*
__STATIC_INLINE void LL_LCD_SetVoltageLevel(LCD_TypeDef *LCDx, uint32_t Level)
{
  MODIFY_REG(LCDx->CR, LCD_CR_VCP_SEL, Level);
}
*/

/**
  * @brief  Get LCD Voltage Level
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_2P6
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_2P74
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_2P88
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P02
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P16
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P3
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P44
  *         @arg @ref LL_LCD_VOLTAGE_LEVEL_3P58
  */
/*
__STATIC_INLINE uint32_t LL_LCD_GetVoltageLevel(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_VCP_SEL));
}
*/

/**
  * @}
  */

/** @defgroup LCD_LL_EF_CHARGEPUMP LCD Chargepump
  * @{
  */
/**
  * @brief  Set LCD ChargePump Set Time.
  * @param  LCDx LCD Instance
  * @param  Time This parameter can be one of the following values:
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_256CLOCK
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_512CLOCK
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_1024CLOCK
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_2048CLOCK
  * @retval None
  */
/*
__STATIC_INLINE void LL_LCD_SetChargePumpSetTime(LCD_TypeDef *LCDx, uint32_t Time)
{
  MODIFY_REG(LCDx->CR, LCD_CR_CP_ST, Time);
}
*/

/**
  * @brief  Get LCD ChargePump Set Time.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_256CLOCK
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_512CLOCK
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_1024CLOCK
  *         @arg @ref LL_LCD_CHARGEPUMP_SETTIME_2048CLOCK
  */
/*
__STATIC_INLINE uint32_t LL_LCD_GetChargePumpSetTime(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_CP_ST));
}
*/

/**
  * @brief  Set LCD ChargePump Frequency.
  * @param  LCDx LCD Instance
  * @param  Frequency This parameter can be one of the following values:
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_512HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_1024HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_2048HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_4096HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_8192HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_16384HZ
  * @retval None
  */
/*
__STATIC_INLINE void LL_LCD_SetChargePumpFrequency(LCD_TypeDef *LCDx, uint32_t Frequency)
{
  MODIFY_REG(LCDx->CR, LCD_CR_CP_FRQ, Frequency);
}
*/

/**
  * @brief  Get LCD ChargePump Frequency.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_512HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_1024HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_2048HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_4096HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_8192HZ
  *         @arg @ref LL_LCD_CHARGEPUMP_FREQ_16384HZ
  */
/*
__STATIC_INLINE uint32_t LL_LCD_GetChargePumpFrequency(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_CP_FRQ));
}
*/

/**
  * @}
  */

/** @defgroup LCD_LL_EF_BIAS LCD BIAS
  * @{
  */
/**
  * @brief  Set LCD bias.
  * @param  LCDx LCD Instance
  * @param  Bias This parameter can be one of the following values:
  *         @arg @ref LL_LCD_BIAS_1_4
  *         @arg @ref LL_LCD_BIAS_1_3
  *         @arg @ref LL_LCD_BIAS_1_2
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetBias(LCD_TypeDef *LCDx, uint32_t Bias)
{
  MODIFY_REG(LCDx->CR, LCD_CR_BIAS, Bias);
}

/**
  * @brief  Get LCD bias.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_BIAS_1_4
  *         @arg @ref LL_LCD_BIAS_1_3
  *         @arg @ref LL_LCD_BIAS_1_2
  */
__STATIC_INLINE uint32_t LL_LCD_GetBias(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_BIAS));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_SCAN_FREQ LCD Scan Frequency
  * @{
  */
/**
  * @brief  Set LCD scan frequency.
  * @param  LCDx LCD Instance
  * @param  ScanFreq This parameter can be one of the following values:
  *         @arg @ref LL_LCD_SCAN_FREQ_64HZ
  *         @arg @ref LL_LCD_SCAN_FREQ_128HZ
  *         @arg @ref LL_LCD_SCAN_FREQ_256HZ
  *         @arg @ref LL_LCD_SCAN_FREQ_512HZ
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetScanFreq(LCD_TypeDef *LCDx, uint32_t ScanFreq)
{
  MODIFY_REG(LCDx->CR, LCD_CR_LCDCLK, ScanFreq);
}

/**
  * @brief  Get LCD scan frequency.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_SCAN_FREQ_64HZ
  *         @arg @ref LL_LCD_SCAN_FREQ_128HZ
  *         @arg @ref LL_LCD_SCAN_FREQ_256HZ
  *         @arg @ref LL_LCD_SCAN_FREQ_512HZ
  */
__STATIC_INLINE uint32_t LL_LCD_GetScanFreq(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_LCDCLK));
}
/**
  * @}
  */

