xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_lcd.h
/** @defgroup LCD_LL_EF_MODE LCD Mode
  * @{
  */
/**
  * @brief  Set LCD mode.
  * @param  LCDx LCD Instance
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_LCD_MODE_0
  *         @arg @ref LL_LCD_MODE_1
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetMode(LCD_TypeDef *LCDx, uint32_t Mode)
{
  MODIFY_REG(LCDx->CSR, LCD_CSR_MODE, Mode);
}

/**
  * @brief  Get LCD mode.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_MODE_0
  *         @arg @ref LL_LCD_MODE_1
  */
__STATIC_INLINE uint32_t LL_LCD_GetMode(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CSR, LCD_CSR_MODE));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_COMSEGDRIVETYPE  LCD ComSegDrive Type
  * @{
  */
/**
  * @brief  Set LCD ComSegDrive Type.
  * @param  LCDx LCD Instance
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_LCD_COMSEGDRIVE_TYPE_A
  *         @arg @ref LL_LCD_COMSEGDRIVE_TYPE_B
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetComSegDriveType(LCD_TypeDef *LCDx, uint32_t Type)
{
  MODIFY_REG(LCDx->CR, LCD_CR_COMSEG_DRV_TYPE, Type);
}

/**
  * @brief  Get LCD ComSegDrive Type.
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_COMSEGDRIVE_TYPE_A
  *         @arg @ref LL_LCD_COMSEGDRIVE_TYPE_B
  */
__STATIC_INLINE uint32_t LL_LCD_GetComSegDriveType(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_COMSEG_DRV_TYPE));
}
/**
  * @}
  */

/**
  * @brief  Enable LCD peripheral.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_Enable(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->CR,  LCD_CR_EN);
}

/**
  * @brief  Disable LCD peripheral.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_Disable(LCD_TypeDef *LCDx)
{
  CLEAR_BIT(LCDx->CR, LCD_CR_EN);
}

/**
  * @brief  Check if LCD peripheral is enabled
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabled(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CR, LCD_CR_EN) == (LCD_CR_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Update Request.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_EnableUpdateRequect(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->CSR,  LCD_CSR_UDR);
}

/**
  * @brief  Update Request Status
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledUpdateRequect(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_UDR) == (LCD_CSR_UDR)) ? 1UL : 0UL);
}

/** @defgroup LCD_LL_EF_BLINK LCD Blink
  * @{
  */
/**
  * @brief  Enable LCD blink mode.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_EnableBlink(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->CSR, LCD_CSR_BLINKEN);
}

/**
  * @brief  Disable LCD blink mode.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_DisableBlink(LCD_TypeDef *LCDx)
{
  CLEAR_BIT(LCDx->CSR, LCD_CSR_BLINKEN);
}

/**
  * @brief  Check if LCD blink mode is enabled.
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledBlink(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_BLINKEN) == (LCD_CSR_BLINKEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the number of frames corresponding to LCD blink frequency and interrupt interval.
  * @param  LCDx LCD Instance
  * @param  Count Value between Min_Data=0x00 and Max_Data=0x3F
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetBlinkCount(LCD_TypeDef *LCDx, uint32_t Count)
{
  MODIFY_REG(LCDx->CSR, LCD_CSR_BLINKCNT, Count);
}

/**
  * @brief  Get the number of frames corresponding to LCD blink frequency and interrupt interval.
  * @param  LCDx LCD Instance
  * @retval Returned between Min_Data=0x00 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_LCD_GetBlinkCount(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CSR, LCD_CSR_BLINKCNT));
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_SWCAPDRIVENUMBER SW CAP Drive Number
  * @{
  */
/**
  * @brief  Set the number of SWCAP Drive Number
  * @param  LCDx LCD Instance
  * @param  Number This parameter can be one of the following values:
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_4
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_8
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_16
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_32
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_64
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetSWCAPDriveNumber(LCD_TypeDef *LCDx, uint32_t Number)
{
  MODIFY_REG(LCDx->CSR, LCD_CSR_SWCAP_DRV_NUM, Number);
}

/**
  * @brief  Get the number of SWCAP Drive Number
  * @param  LCDx LCD Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_4
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_8
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_16
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_32
  *         @arg @ref LL_LCD_SWCAPDRIVE_NUMBER_64
  */
__STATIC_INLINE uint32_t LL_LCD_GetSWCAPDriveNumber(LCD_TypeDef *LCDx)
{
  return (uint32_t)(READ_BIT(LCDx->CSR, LCD_CSR_SWCAP_DRV_NUM));
}
/**
  * @}
  */


/** @defgroup LCD_LL_EF_IT_Management IT Management
  * @{
  */
/**
  * @brief  Enable LCD BKF interrupt.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_EnableIT_BKF(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->CSR, LCD_CSR_BKFIE);
}

/**
  * @brief  Enable LCD SOF interrupt.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_EnableIT_SOF(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->CSR, LCD_CSR_SOFIE);
}

/**
  * @brief  Enable LCD UDD interrupt.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_EnableIT_UDD(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->CSR, LCD_CSR_UDDIE);
}

/**
  * @brief  Disable LCD BKF interrupt.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_DisableIT_BKF(LCD_TypeDef *LCDx)
{
  CLEAR_BIT(LCDx->CSR, LCD_CSR_BKFIE);
}

/**
  * @brief  Disable LCD SOF interrupt.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_DisableIT_SOF(LCD_TypeDef *LCDx)
{
  CLEAR_BIT(LCDx->CSR, LCD_CSR_SOFIE);
}

/**
  * @brief  Disable LCD UDD interrupt.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_DisableIT_UDD(LCD_TypeDef *LCDx)
{
  CLEAR_BIT(LCDx->CSR, LCD_CSR_UDDIE);
}

/**
  * @brief  Check if LCD BKF interrupt is enabled
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledIT_BKF(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_BKFIE) == (LCD_CSR_BKFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LCD SOF interrupt is enabled
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledIT_SOF(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_SOFIE) == (LCD_CSR_SOFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LCD UDD interrupt is enabled
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledIT_UDD(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_UDDIE) == (LCD_CSR_UDDIE)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup LCD_LL_EF_FLAG_Management FLAG Management
  * @{
  */
/**
  * @brief  Get LCD ENS flag.
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsActiveFlag_ENS(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_ENS) == (LCD_CSR_ENS)) ? 1UL : 0UL);
}

/**
  * @brief  Get LCD BKF flag.
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsActiveFlag_BKF(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_BKF) == (LCD_CSR_BKF)) ? 1UL : 0UL);
}

/**
  * @brief  Get LCD SOF flag.
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsActiveFlag_SOF(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_SOF) == (LCD_CSR_SOF)) ? 1UL : 0UL);
}

/**
  * @brief  Get LCD UDD flag.
  * @param  LCDx LCD Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsActiveFlag_UDD(LCD_TypeDef *LCDx)
{
  return ((READ_BIT(LCDx->CSR, LCD_CSR_UDD) == (LCD_CSR_UDD)) ? 1UL : 0UL);
}

/**
  * @brief  Clear LCD BKF flag.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_ClearFlag_BKF(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->INTCLR, LCD_INTCLR_BKFC);
}

/**
  * @brief  Clear LCD SOF flag.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_ClearFlag_SOF(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->INTCLR, LCD_INTCLR_SOFC);
}

/**
  * @brief  Clear LCD UDD flag.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_ClearFlag_UDD(LCD_TypeDef *LCDx)
{
  SET_BIT(LCDx->INTCLR, LCD_INTCLR_UDDC);
}

/**
  * @}
  */

/**
  * @brief  Set LCD SEG COM port output enable.
  * @param  LCDx LCD Instance
  * @param  SegCom pointer to a LCD_SegComTypeDef structure that contains
  *         the configuration information for LCD SEG COM port output enable.
  * @retval None
  */
__STATIC_INLINE void LL_LCD_SetSegCom(LCD_TypeDef *LCDx, LL_LCD_SegComTypeDef *SegCom)
{
  WRITE_REG(LCDx->POEN0, SegCom->Seg0_31);
  WRITE_REG(LCDx->POEN1, SegCom->Seg32_39_Com0_7_t.Seg32_39_Com0_7);
}

/**
  * @brief  Writes in the specific LCD RAM.
  * @param  LCDx LCD Instance
  * @param  RAMRegisterIndex specifies the LCD RAM Register.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_LCD_RAM_REGISTER0
  *         @arg @ref LL_LCD_RAM_REGISTER1
  *         @arg @ref LL_LCD_RAM_REGISTER2
  *         @arg @ref LL_LCD_RAM_REGISTER3
  *         @arg @ref LL_LCD_RAM_REGISTER4
  *         @arg @ref LL_LCD_RAM_REGISTER5
  *         @arg @ref LL_LCD_RAM_REGISTER6
  *         @arg @ref LL_LCD_RAM_REGISTER7
  *         @arg @ref LL_LCD_RAM_REGISTER8
  *         @arg @ref LL_LCD_RAM_REGISTER9
  *         @arg @ref LL_LCD_RAM_REGISTER10
  *         @arg @ref LL_LCD_RAM_REGISTER11
  *         @arg @ref LL_LCD_RAM_REGISTER12
  *         @arg @ref LL_LCD_RAM_REGISTER13
  *         @arg @ref LL_LCD_RAM_REGISTER14
  *         @arg @ref LL_LCD_RAM_REGISTER15
  * @param  Data specifies LCD Data Value to be written.
  * @retval None
  */
__STATIC_INLINE void LL_LCD_Write(LCD_TypeDef *LCDx, uint32_t RAMRegisterIndex, uint32_t Data)
{
  WRITE_REG(LCDx->RAM[RAMRegisterIndex], Data);
}

/**
  * @brief  Clears the LCD RAM registers.
  * @param  LCDx LCD Instance
  * @retval None
  */
__STATIC_INLINE void LL_LCD_Clear(LCD_TypeDef *LCDx)
{
  register uint32_t counter = 0U;
  for(counter = LL_LCD_RAM_REGISTER0; counter <= LL_LCD_RAM_REGISTER15; counter++)
  {
    LCDx->RAM[counter] = 0U;
  }
}
  
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup LCD_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_LCD_DeInit(LCD_TypeDef *LCDx);
ErrorStatus LL_LCD_Init(LCD_TypeDef *LCDx, LL_LCD_InitTypeDef *LCD_InitStruct);
void        LL_LCD_StructInit(LL_LCD_InitTypeDef *LCD_InitStruct);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */
  
#endif /* defined (LCD)*/
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32L090_LL_LCD_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
